app/controllers/games_controller.rb

SELECT "games".* FROM "games"
---
  def index
    @games = Game.all

SELECT "games".* FROM "games" WHERE "games"."id" = 33 LIMIT 1
---
  def show
    @game  = Game.find(params[:id])

INSERT INTO "games" ("name", "starting_bet", "created_at", "updated_at", "win_or_lose", "decks", "hands", "user_hands", "dealers_hands", "deck") VALUES ('Courtnae ', 200.0, '2026-09-13 17:37:58.881461', '2026-09-13 17:37:58.881461', NULL, NULL, NULL, NULL, NULL, NULL) RETURNING "id"
---
  def create
    @game = Game.start_game(name: game_params[:name], starting_bet: game_params[:starting_bet])

    if @game.save

SELECT "games".* FROM "games" WHERE "games"."id" = 36 LIMIT 1
---
    def set_game
      @game = Game.find(params.expect(:id))