app/controllers/games_controller.rb

    def set_game
      @game = Game.find(params.expect(:id))
---
SELECT "games".* FROM "games" WHERE "games"."id" = 1 LIMIT 1