app/models/game.rb

  def hit(player)
    remaining = deck
    unless @bust
      if player == "dealer"
        new_cards = dealers_hands + [ remaining.pop ]
        Game.update(dealers_hands: new_cards, deck: remaining)
---
UPDATE "games" SET "updated_at" = '2026-09-16 01:16:39.147494', "dealers_hands" = '["3-C","4-H","7-D"]', "deck" = '["J-H","Q-D","6-H","7-S","3-H","10-H","3-D","K-H","2-S","9-H","A-S","Q-C","J-C","10-D","5-S","6-C","2-D","J-S","4-S","10-C","8-H","A-D","9-S","7-C","5-H","4-D","8-C","Q-H","8-D","10-S","6-S","2-H"]' WHERE "games"."id" = 31